Documents/АР17_КорректировкаОстатковРасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_КорректировкаОстатковРасчетовПоДоговорам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_РасчетыПоДоговорам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорАренды</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическийОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчетов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_ПроведениеДоговораАренды</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/АР_РасчетыПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_РасчетыПоДоговорам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ПроведениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/АР17_КорректировкаОстатковРасчетовПоДоговорам/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Для Каждого Стр Из ВводОстатков Цикл
		
		Если Не ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда Стр.ГруппаУслуг = Справочники.АР_ГруппыУслуг.БезГруппы; КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧДока.ДокументРасчетов,
		|	ТЧДока.ДоговорАренды,
		|	ТЧДока.ГруппаУслуг,
		|	ТЧДока.Номенклатура,
		|	ТЧДока.ФактическийОстаток
		|ПОМЕСТИТЬ ВТТЧДока
		|ИЗ
		|	&ТЧДока КАК ТЧДока
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Рег.СуммаОстаток, 0) КАК ОстатокПоДаннымУчета,
		|	ВТТЧДока.ДокументРасчетов,
		|	ВТТЧДока.ДоговорАренды,
		|	ВТТЧДока.ГруппаУслуг,
		|	ВТТЧДока.Номенклатура,
		|	ВТТЧДока.ФактическийОстаток
		|ИЗ
		|	ВТТЧДока КАК ВТТЧДока
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(&Дата, ) КАК Рег
		|		ПО Рег.ДоговорКонтрагента = ВТТЧДока.ДоговорАренды.ДоговорКонтрагента
		|		И Рег.ГруппаУслуг = ВТТЧДока.ГруппаУслуг И Рег.Номенклатура = ВТТЧДока.Номенклатура
		|		И Рег.ДокументРасчетов = ВТТЧДока.ДокументРасчетов
		|";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ТЧДока", ВводОстатков);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Движения.АР_РасчетыПоДоговорам.Прочитать();
	Движения.АР_РасчетыПоДоговорам.Очистить();
	Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
	Пока РЗ.Следующий() Цикл
		
		Разница = РЗ.ФактическийОстаток - РЗ.ОстатокПоДаннымУчета;
		
		Движение = Движения.АР_РасчетыПоДоговорам.Добавить();
		
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Месяц = НачалоМесяца(Дата);
		Движение.Контрагент = РЗ.ДоговорАренды.Контрагент;
		Движение.Организация = РЗ.ДоговорАренды.Организация;
		Движение.ДоговорКонтрагента = РЗ.ДоговорАренды.ДоговорКонтрагента;
		Движение.Сумма = Разница;
		Движение.ГруппаУслуг = РЗ.ГруппаУслуг;
		Движение.Номенклатура = РЗ.Номенклатура;
		Движение.ДокументРасчетов = РЗ.ДокументРасчетов;
	
	КонецЦикла; 
	
	Движения.Записать();

КонецПроцедуры
